package com.simbirSoft.doTasksHere;

/**
 * Метод принимает три строки с числами, разделенными запятой и пробелом.
 * Затем метод переводит эти строки в массивы чисел. На выходе числа, разделенные запятой и пробелом,
 * которые присутствуют во всех трех массивах. Если повторяющихся чисел нет, отдать сообщение "No repeats"
 */

public class Task7 {

    // Реализовать консольный ввод - вывод, выполнение метода здесь
    public static void main(String[] args) {

    }

    // Писать основную логику здесь
    protected static String task7(String str) {
        return null;
    }
}
